22naresn/IMU/ior5f10ppj.h
#define IICRSV0           IICF0_bit.no0
#define STCEN0            IICF0_bit.no1
#define IICBSY0           IICF0_bit.no6
#define STCF0             IICF0_bit.no7

#define RCLOE1            RTCC0_bit.no5
#define RTCE              RTCC0_bit.no7

#define RWAIT             RTCC1_bit.no0
#define RWST              RTCC1_bit.no1
#define RIFG              RTCC1_bit.no3
#define WAFG              RTCC1_bit.no4
#define WALIE             RTCC1_bit.no6
#define WALE              RTCC1_bit.no7

#define HIOSTOP           CSC_bit.no0
#define XTSTOP            CSC_bit.no6
#define MSTOP             CSC_bit.no7

#define MCM0              CKC_bit.no4
#define MCS               CKC_bit.no5
#define CSS               CKC_bit.no6
#define CLS               CKC_bit.no7

#define PCLOE0            CKS0_bit.no7

#define LVIF              LVIM_bit.no0
#define LVIOMSK           LVIM_bit.no1
#define LVISEN            LVIM_bit.no7

#define LVILV             LVIS_bit.no0
#define LVIMD             LVIS_bit.no7

#define TMIF05            IF2L_bit.no0
#define TMIF06            IF2L_bit.no1
#define TMIF07            IF2L_bit.no2
#define LIN0WUPIF         IF2L_bit.no3
#define PIF11             IF2L_bit.no3
#define KRIF              IF2L_bit.no4
#define CAN0ERRIF         IF2L_bit.no5
#define CAN0WUPIF         IF2L_bit.no6
#define CAN0CFRIF         IF2L_bit.no7

#define CAN0TRMIF         IF2H_bit.no0
#define CANGRFRIF         IF2H_bit.no1
#define CANGERRIF         IF2H_bit.no2
#define TMIF10            IF2H_bit.no3
#define TMIF11            IF2H_bit.no4
#define TMIF12            IF2H_bit.no5
#define TMIF13            IF2H_bit.no6
#define FLIF              IF2H_bit.no7

#define LIN1WUPIF         IF3L_bit.no0
#define PIF12             IF3L_bit.no0
#define LIN1TRMIF         IF3L_bit.no1
#define LIN1RVCIF         IF3L_bit.no2
#define LIN1IF            IF3L_bit.no3
#define LIN1STAIF         IF3L_bit.no3
#define TMIF14            IF3L_bit.no4
#define TMIF15            IF3L_bit.no5
#define TMIF16            IF3L_bit.no6
#define TMIF17            IF3L_bit.no7

#define TMMK05            MK2L_bit.no0
#define TMMK06            MK2L_bit.no1
#define TMMK07            MK2L_bit.no2
#define LIN0WUPMK         MK2L_bit.no3
#define PMK11             MK2L_bit.no3
#define KRMK              MK2L_bit.no4
#define CAN0ERRMK         MK2L_bit.no5
#define CAN0WUPMK         MK2L_bit.no6
#define CAN0CFRMK         MK2L_bit.no7

#define CAN0TRMMK         MK2H_bit.no0
#define CANGRFRMK         MK2H_bit.no1
#define CANGERRMK         MK2H_bit.no2
#define TMMK10            MK2H_bit.no3
#define TMMK11            MK2H_bit.no4
#define TMMK12            MK2H_bit.no5
#define TMMK13            MK2H_bit.no6
#define FLMK              MK2H_bit.no7

#define LIN1WUPMK         MK3L_bit.no0
#define PMK12             MK3L_bit.no0
#define LIN1TRMMK         MK3L_bit.no1
#define LIN1RVCMK         MK3L_bit.no2
#define LIN1MK            MK3L_bit.no3
#define LIN1STAMK         MK3L_bit.no3
#define TMMK14            MK3L_bit.no4
#define TMMK15            MK3L_bit.no5
#define TMMK16            MK3L_bit.no6
#define TMMK17            MK3L_bit.no7

#define TMPR005           PR02L_bit.no0
#define TMPR006           PR02L_bit.no1
#define TMPR007           PR02L_bit.no2
#define LIN0WUPPR0        PR02L_bit.no3
#define PPR011            PR02L_bit.no3
#define KRPR0             PR02L_bit.no4
#define CAN0ERRPR0        PR02L_bit.no5
#define CAN0WUPPR0        PR02L_bit.no6
#define CAN0CFRPR0        PR02L_bit.no7

#define CAN0TRMPR0        PR02H_bit.no0
#define CANGRFRPR0        PR02H_bit.no1
#define CANGERRPR0        PR02H_bit.no2
#define TMPR010           PR02H_bit.no3
#define TMPR011           PR02H_bit.no4
#define TMPR012           PR02H_bit.no5
#define TMPR013           PR02H_bit.no6
#define FLPR0             PR02H_bit.no7

#define LIN1WUPPR0        PR03L_bit.no0
#define PPR012            PR03L_bit.no0
#define LIN1TRMPR0        PR03L_bit.no1
#define LIN1RVCPR0        PR03L_bit.no2
#define LIN1PR0           PR03L_bit.no3
#define LIN1STAPR0        PR03L_bit.no3
#define TMPR014           PR03L_bit.no4
#define TMPR015           PR03L_bit.no5
#define TMPR016           PR03L_bit.no6
#define TMPR017           PR03L_bit.no7

#define TMPR105           PR12L_bit.no0
#define TMPR106           PR12L_bit.no1
#define TMPR107           PR12L_bit.no2
#define LIN0WUPPR1        PR12L_bit.no3
#define PPR111            PR12L_bit.no3
#define KRPR1             PR12L_bit.no4
#define CAN0ERRPR1        PR12L_bit.no5
#define CAN0WUPPR1        PR12L_bit.no6
#define CAN0CFRPR1        PR12L_bit.no7

#define CAN0TRMPR1        PR12H_bit.no0
#define CANGRFRPR1        PR12H_bit.no1
#define CANGERRPR1        PR12H_bit.no2
#define TMPR110           PR12H_bit.no3
#define TMPR111           PR12H_bit.no4
#define TMPR112           PR12H_bit.no5
#define TMPR113           PR12H_bit.no6
#define FLPR1             PR12H_bit.no7

#define LIN1WUPPR1        PR13L_bit.no0
#define PPR112            PR13L_bit.no0
#define LIN1TRMPR1        PR13L_bit.no1
#define LIN1RVCPR1        PR13L_bit.no2
#define LIN1PR1           PR13L_bit.no3
#define LIN1STAPR1        PR13L_bit.no3
#define TMPR114           PR13L_bit.no4
#define TMPR115           PR13L_bit.no5
#define TMPR116           PR13L_bit.no6
#define TMPR117           PR13L_bit.no7

#define WDTIIF            IF0L_bit.no0
#define LVIIF             IF0L_bit.no1
#define PIF0              IF0L_bit.no2
#define PIF1              IF0L_bit.no3
#define PIF2              IF0L_bit.no4
#define PIF3              IF0L_bit.no5
#define PIF4              IF0L_bit.no6
#define SPMIF             IF0L_bit.no6
#define CMPIF0            IF0L_bit.no7
#define PIF5              IF0L_bit.no7

#define CLMIF             IF0H_bit.no0
#define PIF13             IF0H_bit.no0
#define CSIIF00           IF0H_bit.no1
#define IICIF00           IF0H_bit.no1
#define STIF0             IF0H_bit.no1
#define CSIIF01           IF0H_bit.no2
#define IICIF01           IF0H_bit.no2
#define SRIF0             IF0H_bit.no2
#define TRDIF0            IF0H_bit.no3
#define TRDIF1            IF0H_bit.no4
#define TRJIF0            IF0H_bit.no5
#define RAMIF             IF0H_bit.no6
#define LIN0TRMIF         IF0H_bit.no7

#define LIN0RVCIF         IF1L_bit.no0
#define LIN0IF            IF1L_bit.no1
#define LIN0STAIF         IF1L_bit.no1
#define IICAIF0           IF1L_bit.no2
#define PIF8              IF1L_bit.no3
#define RTCIF             IF1L_bit.no3
#define TMIF00            IF1L_bit.no4
#define TMIF01            IF1L_bit.no5
#define TMIF02            IF1L_bit.no6
#define TMIF03            IF1L_bit.no7

#define ADIF              IF1H_bit.no0
#define PIF6              IF1H_bit.no1
#define TMIF11H           IF1H_bit.no1
#define PIF7              IF1H_bit.no2
#define TMIF13H           IF1H_bit.no2
#define PIF9              IF1H_bit.no3
#define TMIF01H           IF1H_bit.no3
#define PIF10             IF1H_bit.no4
#define TMIF03H           IF1H_bit.no4
#define CSIIF10           IF1H_bit.no5
#define IICIF10           IF1H_bit.no5
#define STIF1             IF1H_bit.no5
#define CSIIF11           IF1H_bit.no6
#define IICIF11           IF1H_bit.no6
#define SRIF1             IF1H_bit.no6
#define TMIF04            IF1H_bit.no7

