22naresn/IMU/ior5f10ppj.h
#define WDTIMK            MK0L_bit.no0
#define LVIMK             MK0L_bit.no1
#define PMK0              MK0L_bit.no2
#define PMK1              MK0L_bit.no3
#define PMK2              MK0L_bit.no4
#define PMK3              MK0L_bit.no5
#define PMK4              MK0L_bit.no6
#define SPMMK             MK0L_bit.no6
#define CMPMK0            MK0L_bit.no7
#define PMK5              MK0L_bit.no7

#define CLMMK             MK0H_bit.no0
#define PMK13             MK0H_bit.no0
#define CSIMK00           MK0H_bit.no1
#define IICMK00           MK0H_bit.no1
#define STMK0             MK0H_bit.no1
#define CSIMK01           MK0H_bit.no2
#define IICMK01           MK0H_bit.no2
#define SRMK0             MK0H_bit.no2
#define TRDMK0            MK0H_bit.no3
#define TRDMK1            MK0H_bit.no4
#define TRJMK0            MK0H_bit.no5
#define RAMMK             MK0H_bit.no6
#define LIN0TRMMK         MK0H_bit.no7

#define LIN0RVCMK         MK1L_bit.no0
#define LIN0MK            MK1L_bit.no1
#define LIN0STAMK         MK1L_bit.no1
#define IICAMK0           MK1L_bit.no2
#define PMK8              MK1L_bit.no3
#define RTCMK             MK1L_bit.no3
#define TMMK00            MK1L_bit.no4
#define TMMK01            MK1L_bit.no5
#define TMMK02            MK1L_bit.no6
#define TMMK03            MK1L_bit.no7

#define ADMK              MK1H_bit.no0
#define PMK6              MK1H_bit.no1
#define TMMK11H           MK1H_bit.no1
#define PMK7              MK1H_bit.no2
#define TMMK13H           MK1H_bit.no2
#define PMK9              MK1H_bit.no3
#define TMMK01H           MK1H_bit.no3
#define PMK10             MK1H_bit.no4
#define TMMK03H           MK1H_bit.no4
#define CSIMK10           MK1H_bit.no5
#define IICMK10           MK1H_bit.no5
#define STMK1             MK1H_bit.no5
#define CSIMK11           MK1H_bit.no6
#define IICMK11           MK1H_bit.no6
#define SRMK1             MK1H_bit.no6
#define TMMK04            MK1H_bit.no7

#define WDTIPR0           PR00L_bit.no0
#define LVIPR0            PR00L_bit.no1
#define PPR00             PR00L_bit.no2
#define PPR01             PR00L_bit.no3
#define PPR02             PR00L_bit.no4
#define PPR03             PR00L_bit.no5
#define PPR04             PR00L_bit.no6
#define SPMPR0            PR00L_bit.no6
#define CMPPR00           PR00L_bit.no7
#define PPR05             PR00L_bit.no7

#define CLMPR0            PR00H_bit.no0
#define PPR013            PR00H_bit.no0
#define CSIPR000          PR00H_bit.no1
#define IICPR000          PR00H_bit.no1
#define STPR00            PR00H_bit.no1
#define CSIPR001          PR00H_bit.no2
#define IICPR001          PR00H_bit.no2
#define SRPR00            PR00H_bit.no2
#define TRDPR00           PR00H_bit.no3
#define TRDPR01           PR00H_bit.no4
#define TRJPR00           PR00H_bit.no5
#define RAMPR0            PR00H_bit.no6
#define LIN0TRMPR0        PR00H_bit.no7

#define LIN0RVCPR0        PR01L_bit.no0
#define LIN0PR0           PR01L_bit.no1
#define LIN0STAPR0        PR01L_bit.no1
#define IICAPR00          PR01L_bit.no2
#define PPR08             PR01L_bit.no3
#define RTCPR0            PR01L_bit.no3
#define TMPR000           PR01L_bit.no4
#define TMPR001           PR01L_bit.no5
#define TMPR002           PR01L_bit.no6
#define TMPR003           PR01L_bit.no7

#define ADPR0             PR01H_bit.no0
#define PPR06             PR01H_bit.no1
#define TMPR011H          PR01H_bit.no1
#define PPR07             PR01H_bit.no2
#define TMPR013H          PR01H_bit.no2
#define PPR09             PR01H_bit.no3
#define TMPR001H          PR01H_bit.no3
#define PPR010            PR01H_bit.no4
#define TMPR003H          PR01H_bit.no4
#define CSIPR010          PR01H_bit.no5
#define IICPR010          PR01H_bit.no5
#define STPR01            PR01H_bit.no5
#define CSIPR011          PR01H_bit.no6
#define IICPR011          PR01H_bit.no6
#define SRPR01            PR01H_bit.no6
#define TMPR004           PR01H_bit.no7

#define WDTIPR1           PR10L_bit.no0
#define LVIPR1            PR10L_bit.no1
#define PPR10             PR10L_bit.no2
#define PPR11             PR10L_bit.no3
#define PPR12             PR10L_bit.no4
#define PPR13             PR10L_bit.no5
#define PPR14             PR10L_bit.no6
#define SPMPR1            PR10L_bit.no6
#define CMPPR10           PR10L_bit.no7
#define PPR15             PR10L_bit.no7

#define CLMPR1            PR10H_bit.no0
#define PPR113            PR10H_bit.no0
#define CSIPR100          PR10H_bit.no1
#define IICPR100          PR10H_bit.no1
#define STPR10            PR10H_bit.no1
#define CSIPR101          PR10H_bit.no2
#define IICPR101          PR10H_bit.no2
#define SRPR10            PR10H_bit.no2
#define TRDPR10           PR10H_bit.no3
#define TRDPR11           PR10H_bit.no4
#define TRJPR10           PR10H_bit.no5
#define RAMPR1            PR10H_bit.no6
#define LIN0TRMPR1        PR10H_bit.no7

#define LIN0RVCPR1        PR11L_bit.no0
#define LIN0PR1           PR11L_bit.no1
#define LIN0STAPR1        PR11L_bit.no1
#define IICAPR10          PR11L_bit.no2
#define PPR18             PR11L_bit.no3
#define RTCPR1            PR11L_bit.no3
#define TMPR100           PR11L_bit.no4
#define TMPR101           PR11L_bit.no5
#define TMPR102           PR11L_bit.no6
#define TMPR103           PR11L_bit.no7

#define ADPR1             PR11H_bit.no0
#define PPR16             PR11H_bit.no1
#define TMPR111H          PR11H_bit.no1
#define PPR17             PR11H_bit.no2
#define TMPR113H          PR11H_bit.no2
#define PPR19             PR11H_bit.no3
#define TMPR101H          PR11H_bit.no3
#define PPR110            PR11H_bit.no4
#define TMPR103H          PR11H_bit.no4
#define CSIPR110          PR11H_bit.no5
#define IICPR110          PR11H_bit.no5
#define STPR11            PR11H_bit.no5
#define CSIPR111          PR11H_bit.no6
#define IICPR111          PR11H_bit.no6
#define SRPR11            PR11H_bit.no6
#define TMPR104           PR11H_bit.no7

#define MAA               PMC_bit.no0

#pragma language=restore

#endif /* __IAR_SYSTEMS_ICC__ */

#ifdef __IAR_SYSTEMS_ASM__

/*----------------------------------------------
 *       SFR declarations
 *--------------------------------------------*/

